### 1. DataFrame

In [23]:
import numpy as np
import pandas as pd

- 생성 방법 1: 2차원 데이터, 컬럼, 인덱스

In [24]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),       # 2차원 데이터
    columns=list('XYZ'),                                # 컬럼명
    index=list('abcd')                                  # 인덱스명
)
df1

    X   Y   Z
a  62  77  72
b  62  57  87
c  93  87  53
d  79  45  64

- 생성 방법 2: 딕셔너리의 리스트

In [25]:
data = [
    {'X': 83, 'Y': 59, 'Z': 53},
    {'X': 45, 'Y': 59, 'Z': 45},
    {'X': 50, 'Y': 89, 'Z': 86},
    {'X': 100, 'Y': 46, 'Z': 77},
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  86
d  100  46  77

- 생성 방법 3: 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [26]:
data = {
    'X': [83, 45, 50, 100],
    'Y': [59, 59, 89, 46],
    'Z': [53, 45, 86, 77]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  86
d  100  46  77

In [27]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [28]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [29]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [30]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [31]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

- 연습 문제 4.1.2
    - 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
        - 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
        - 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [33]:
# 1번
col_A, col_B, col_C, col_D, col_E = [], [], [], [], []
np.random.seed = 2023
for i in range(5):
    col_A.append(chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91)))
    col_B.append(np.random.randint(1, 7))
    col_C.append(np.random.randint(40, 101))
    col_D.append(np.random.randint(1, 100) * 1000)
    col_E.append(np.round(np.random.rand(), 4))
df4 = pd.DataFrame(
    {'col_A': col_A, 'col_B': col_B, 'col_C': col_C, 'col_D': col_D, 'col_E': col_E,}
)
df4

  col_A  col_B  col_C  col_D   col_E
0    RO      1     47  64000  0.1621
1    AR      1     89  50000  0.2035
2    VG      5     46  16000  0.7451
3    YI      5     41  72000  0.2053
4    HN      5     65  35000  0.5967

In [51]:
# 2번
data = []
for i in range(5):
    d = {
        'col_A': chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91)),
        'col_B': np.random.randint(1, 7),
        'col_C': np.random.randint(40, 101),
        'col_D': np.random.randint(1, 100) * 1000,
        'col_E': np.round(np.random.rand(), 4)
    }
    data.append(d)
df5 = pd.DataFrame(data)
df5

  col_A  col_B  col_C  col_D   col_E
0    KI      2     48   2000  0.3525
1    KK      1     40   7000  0.0132
2    FF      6     51  96000  0.6294
3    UO      5     86  45000  0.6498
4    PF      5     59  98000  0.4748

- 전치(Transpose)

In [54]:
df1

    X   Y   Z
a  62  77  72
b  62  57  87
c  93  87  53
d  79  45  64

In [52]:
df1.T

    a   b   c   d
X  62  62  93  79
Y  77  57  87  45
Z  72  87  53  64

In [55]:
df5.T

            0       1       2       3       4
col_A      KI      KK      FF      UO      PF
col_B       2       1       6       5       5
col_C      48      40      51      86      59
col_D    2000    7000   96000   45000   98000
col_E  0.3525  0.0132  0.6294  0.6498  0.4748

- 열 데이터의 갱신, 추가, 삭제

In [56]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [57]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [61]:
# 열 이름이 있으면 갱신, 없으면 생성
df['2005-2010 증가율'] = round((df['2010'] - df['2005']) / df['2005'] * 100, 2)
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [62]:
del df['2010-2015 증가율']
df

항목   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

- 열 인덱싱

In [64]:
df['지역']      # 열 이름을 하나만 선택하면 시리즈 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [68]:
df[['2010', '2015']]        # 열 이름을 여러개 리스트로 주면, 데이터프레임 반환

항목     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [69]:
df[['지역']]

항목   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [71]:
df.T[['서울']]

도시                  서울
항목
지역                 수도권
2015           9904312
2010           9631482
2005           9762546
2000           9853972
2005-2010 증가율    -1.34

- 개별 인덱싱

In [75]:
# 열 이름, 행 인덱스
df['지역']['서울'], df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권')

In [76]:
# 컬럼명이 숫자형이면 df.숫자형은 출력되지 않음
df['2015']['서울']

9904312

- 연습 문제 4.1.3
    - 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.
        - 모든 학생의 수학 점수를 시리즈로 나타낸다.
        - 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
        - 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
        - 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
        - 춘향의 점수를 데이터프레임으로 나타낸다.
        - 향단의 점수를 시리즈로 나타낸다.

In [79]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [80]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [81]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [86]:
df['평균'] = round((df['국어'] + df['영어'] + df['수학']) / 3, 1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

In [95]:
import warnings
warnings.filterwarnings('ignore')
df['영어']['방자'] = 80
df['평균'] = round((df['국어'] + df['영어'] + df['수학']) / 3, 1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [92]:
df.T[['춘향']]

      춘향
국어  80.0
영어  90.0
수학  90.0
평균  86.7

In [96]:
df[:1]

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [94]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64